Console.Write("Введите трёхзначное число: ");
int number = int.Parse(Console.ReadLine());
Console.WriteLine(number / 10 % 10);

//11. Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает вторую цифру этого числа.